/**
  ******************************************************************************
  * @file    action.c 
  * @author  MCD Application Team
  * @version V3.5.0
  * @date    08-April-2011
  * @brief   Main program body
  ******************************************************************************
  * @attention
  *
  * 此文件描述周立功CANCOM_100E的格式转换模式的用法，也就是发送规定形式的485数据
  *	帧，和接收规定形式的485数据帧，以及发送之前如何通过结构体构成帧，和接收之后
	*	如何解析帧
	* 整个过程无时间控制 主要是 帧结构的定义和一个实时接受任务
	* 本文件采用的硬件接口是Usart3 别的不要再使用了
  * <h2><center>&copy; COPYRIGHT 2011 STMicroelectronics</center></h2>
  ******************************************************************************
  */ 

/* Includes ------------------------------------------------------------------*/
#include "stm32f10x.h"
#include "action.h"
#include "usart.h"

/* Private typedef -----------------------------------------------------------*/


/* Private define ------------------------------------------------------------*/

/* Private macro -------------------------------------------------------------*/

/* Private variables ---------------------------------------------------------*/

/* Private functions ---------------------------------------------------------*/
/**
  * @brief  
  * @param  
  * @retval 
  */

